{
  "id": "2025-09-28T23-12-53-254Z",
  "title": "Through Ice and Shadow",
  "image": "/images/winter/1759101152366-blob",
  "createdAt": "2025-09-28T23:12:53.254Z",
  "updatedAt": "2025-09-28T23:12:53.254Z",
  "excerpt": "The bitter wind howled through the trees like a vengeful spirit, whipping at the group’s cloaks as they huddled over a miserably cold breakfast. Aelira shivered as she chewed a piece of hard bread, the frost clinging to",
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The bitter wind howled through the trees like a vengeful spirit, whipping at the group’s cloaks as they huddled over a miserably cold breakfast. Aelira shivered as she chewed a piece of hard bread, the frost clinging to her eyelashes. Even Alaric, usually impervious to discomfort, cursed under his breath as he tried to warm his hands over a pitiful ember. The storm was getting worse."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "By midmorning, visibility was nearly gone, the world swallowed in a white haze. They trudged forward, the snow dragging at their boots, only able to see a few feet ahead. Then Alaric halted, raising a hand."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Shelters,” he murmured. “Up ahead. Igloos.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The others stopped as he moved forward, his pistol drawn. The camp was eerily silent. Four squat snow shelters loomed ahead, but no signs of life. Alaric returned to the group and relayed what he had seen."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Stay close,” he warned. “Could be a trap.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "They advanced cautiously. Aelira leaned forward, peering into an igloo. Joshua did the same—only to find himself staring into the tiny, beady eyes of a fey sprite. Before he could react, a rock whistled through the air and struck Aelira squarely in the shoulder. It detonated in a burst of frost, leaving her staggered and deafened. A second later, a tiny arrow flew at Joshua."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "He ducked, then lunged into the igloo. The floor gave way beneath him. He fell hard, landing on his back at the bottom of a hidden pit."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "At that moment, a guttural roar echoed through the snowstorm. A hulking troll barreled out of a nearby cave, its beady eyes locking onto Aelira."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric’s gun roared as he fired at a fey perched in a tree. The bullet struck true, but the creature merely snarled, gripping another rock. A new threat emerged—a twisted ice mephit, wings of jagged frost flapping as it loosed a freezing blast. Alaric reeled, his breath coming in ragged gasps, sickened by the unnatural cold."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira gritted her teeth, blood running from her nose. She raised her hands, sending out a burst of healing energy. Warmth coursed through her allies, but the fey in the tree cackled and cast a spell. Alaric felt his body shrink, his limbs withering until he was no taller than a halfling."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "His fury flared hotter than the cold. Even reduced, he fired again at the tree-bound fey."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua scrambled out of the pit, barking orders to his bear, Titan. The massive beast was already locked in combat with the sprites, swiping at them with crushing claws. Meanwhile, Aelira rifled through the nearest igloo, seizing a thick woolen blanket. She had heard whispers that trolls feared fire. With a spark of kinetic magic, the fabric ignited. She hurled it onto the fallen troll’s body. The air filled with the acrid scent of burning flesh."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The troll screamed and did not rise again."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The fey in the tree hurled another rock, missing Alaric by inches. Titan lunged at a sprite, slamming it into the snow. The creature gave a final, pitiful squeak before it was silenced forever."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then the tree-bound fey made its mistake. Frustrated, it streaked toward Alaric in a reckless charge, an icy sickle raised high. Alaric stood his ground, pressing the barrel of his pistol to the fey’s face and pulling the trigger. The creature’s head snapped backward, its lifeless body falling limply into the snow."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The mephit remained, its supernatural resilience making it nearly impervious to their blows. Alaric snarled, tucking away his pistol and drawing the magic short sword they had found in a previous encounter. The moment the blade met the mephit’s flesh, it howled in pain."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "With a final, decisive strike, the creature crumpled."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric wiped his brow. “Damn, that was not good.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira caught her breath. “We should see where the troll came from.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Maybe after some healing,” Joshua grunted, rubbing a bruised shoulder."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira nodded and sent out another wave of healing energy before they searched the cave. The creatures had hoarded gold and potions, but the real discovery was the cave itself—a safe place to rest from the storm."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then came the boom."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A deafening, electric crackle split the air, reverberating through the icy wasteland. The group fell silent, waiting, tense. The wind howled, but nothing approached."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then, a cry—faint but unmistakable."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Help... someone help...”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua’s expression hardened. “Someone’s out there.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric adjusted his grip on his pistol. “Then we go.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "They pressed forward through the storm, visibility worsening. At last, they reached a clearing where the snow swirled chaotically."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A man lay facedown, an ice spear lodged deep in his back."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira turned him over—and gasped."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“The Black Rider,” she whispered."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric inhaled sharply. “One of Baba Yaga’s heralds.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The world seemed to still. The dying man’s eyes opened, ancient and weary."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Illarion Matveius... Black Midnight,” he croaked. “The last of Baba Yaga’s Three Riders. The world is in peril... Queen Elvanna has betrayed her mother.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "He coughed, blood speckling the snow. “She seeks to cover all of Golarion in ice. Only Baba Yaga can stop her.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric’s disbelief warred with his sense of duty. “And what exactly are we supposed to do?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Find Baba Yaga. Use her Dancing Hut. I secured two of its keys... stolen of power... but I can restore them.” He weakly pulled forth a lock of white hair and a plague doctor’s mask."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua’s hands clenched into fists. “And what happens if we say no?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Illarion’s eyes darkened. “Then the world freezes.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The decision was clear."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“I will do this,” Alaric said grimly."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira nodded. “So will I.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua hesitated. Then sighed. “Fine.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Illarion smiled weakly. “Then take these keys...”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "With shaking hands, he slit his own throat. Blood poured over the relics. As the Rider perished, his magic melted away, leaving only a frail old man."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then, dark sigils flared to life on the foreheads of Alaric, Aelira, Ivan, and Joshua."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric recoiled, his face twisting in horror. “Witchcraft,” he spat. “We’ve been marked.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua eyed his darkened cloak. “Did he just make us the Black Rider?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira exhaled, the weight of fate settling on her shoulders. “I think so.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric turned toward the portal. “We promised.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "With grim determination, they stepped through."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "On the other side, the cold was even worse."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A village loomed in the distance, but the storm was relentless. They struggled forward, pushing against the wind."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then came the cries."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Help! Shoot it!”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "They crested a ridge to find a massive mantis holding a thrashing man in its mandibles. The villagers fought back, but their blows barely scratched the beast."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Titan roared and charged. The mantis turned its attention to the bear, its jagged limbs lashing out. Alaric fired, the shot splintering its carapace. Joshua rushed in, fists glowing with energy, while Aelira healed a dying villager before launching a blast of kinetic energy."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The ice-blue force struck true. The mantis collapsed."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A woman stepped forward, eyeing Aelira. “Thank you,” she said in Skald. “For saving my friend.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira hesitated. “Where are we?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The woman smiled knowingly. “Irrisen.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The storm worsened."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“You’ll never make it far in this,” the woman continued. “Come with us.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric shivered. “Yes. We’re freezing.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As they made camp, the woman introduced herself. “Nadya Petska. Leader of this group.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "When Alaric mentioned the Pale Tower, Nadya spat into the snow."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“My daughter was taken there,” she growled. “We were gathering supplies to barter for her release. But with your strength... perhaps we take her back.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric didn’t hesitate. “We’ll help.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira glanced toward the storm. “And the village we saw?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“My home. Walsby. We will go there first, then to the Pale Tower.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "That night, a stranger arrived—Mierul Ardelain, a Forlarren minstrel. She sang and laughed, but Nadya cut off any questioning."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“She’s not to be trusted,” Nadya warned."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As the group settled in, the storm howled outside. Tomorrow, their journey would begin in earnest."
          }
        ]
      }
    ]
  },
  "book": "the-snows-of-summer",
  "sessionDate": "2025-03-01"
}