{
  "id": "2025-09-28T23-15-01-489Z",
  "title": "The Pale Tower's Shadow",
  "image": "/images/winter/1759101284573-blob",
  "createdAt": "2025-09-28T23:15:01.489Z",
  "updatedAt": "2025-09-28T23:15:01.489Z",
  "excerpt": "The morning sun crested the snow-covered horizon, painting the sky in pale hues of lavender and blue. The chill was biting, but the villagers wasted no time in preparing for their journey. Breakfast was meager—hardtack a",
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The morning sun crested the snow-covered horizon, painting the sky in pale hues of lavender and blue. The chill was biting, but the villagers wasted no time in preparing for their journey. Breakfast was meager—hardtack and salted beef—but it was enough to keep their bellies from growling as they readied the sleds. Dogs barked eagerly, their breath rising in small clouds as they were hitched to their harnesses."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The adventurers sat at the front of the sleds, the cold biting through their clothing. Nadya led the way, her sharp eyes constantly scanning the skies."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then, suddenly, she tensed. “Crows,” she called, her voice low but urgent. The sleds came to an abrupt halt, and she turned back toward them. “Hide,” she ordered, her tone brooking no argument."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "From beneath the sleds, she pulled white tarps and flung them over the adventurers. “Get down. Stay still,” she commanded."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira, ever the scholar, barely had time to whisper, “Why—” before Nadya turned on her and shushed her fiercely."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“They’ll hear you.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The air was thick with silence, save for the distant caws of the approaching birds. The adventurers remained motionless beneath their snowy coverings. But it was no use—Joshua’s large frame made an easy target. The ravens landed atop him, their beady black eyes gleaming with unnatural intelligence as they tore through the cover and attacked."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric was the first to react, flinging off his tarp and drawing his pistol. The crack of gunfire split the frigid air as a bullet tore through a raven, sending a spray of black feathers into the wind. But the birds were relentless, clawing and pecking at Joshua and Titan. They went for the eyes, their beaks sharp as knives. Blood ran down Titan’s face as he let out a pained roar, momentarily blinded."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Ivan!” Aelira shouted."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The sorcerer raised his hands and uttered a fiery incantation. A cone of flame erupted from his palms, engulfing the swarm of birds in an inferno. Screeches of agony filled the air as several ravens plummeted to the ground, their charred bodies hissing against the snow. Those that survived took to the sky, scattering toward the horizon."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric fired a final shot, but several birds escaped. He cursed under his breath, holstering his pistol."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Nadya watched the retreating flock, her expression grim. “They were spies,” she muttered. “This is bad. Very bad.” She turned back to the sleds. “We need to get to Waldsby. Now. They’ll send someone.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The rest of the day was spent pushing through the relentless snow, the cold sinking into their bones. By the time they reached Waldsby, the sun was dipping behind the distant mountains, casting long shadows across the eerily familiar town."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "People stopped in their tracks as the adventurers arrived, their clothing unmistakably foreign. Mothers pulled their children close, whispering in hushed tones."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“They’re dangerous,” one woman murmured, guiding her child away."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Nadya shook her head in exasperation. “Ignore them. Come, I’ll take you to my home.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The small house was unassuming but immaculately clean inside. An older woman, Nadya’s helper, gave them a cautious glance before continuing her work. Nadya disappeared briefly and returned with bundles of thick winter clothing."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“You stand out too much,” she said, handing each of them garments. “You’ll need to dress like a local and lay low. The Pale Tower is too dangerous right now.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "That evening, as they sat around the fire eating a modest meal, Aelira broached the question that had been weighing on her mind. “Why was your daughter taken to the Pale Tower?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Nadya hesitated, her jaw tightening. “The White Witch Nazhena Vasilliovna came to the village,” she said slowly. “My daughter... accidentally insulted her.” She exhaled sharply, her hands clenching into fists. “She had her taken as punishment. She told me if I brought a large shipment of food, she would release my daughter. If you hadn’t helped yesterday, I might not have made it back with the supplies.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A silence settled over the room, thick with unspoken words. Nadya shook her head. “But for now, it’s time to rest.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Morning came with a sense of unease. The house was immaculate again, eerily so. Though the adventurers had cleaned up after themselves, it was as if everything had been reset to perfect order."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan and Alaric found their packs dumped out. Alaric muttered a few choice words about fey, gathering his belongings with a scowl."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The group spent the day in town, shopping for supplies and taking in their surroundings. It didn’t take long to notice something strange—Waldsby was laid out exactly like Heldren, their home village. Even the bell tower rang with an identical chime."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Stranger still, Aelira encountered a gnome who was the spitting image of a gnome from Heldren. To her shock, he revealed that he had a twin brother—one he believed was dead."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As dusk fell, a young messenger approached them with a handwritten note. The Goltiaevas, owners of the White Weasel tavern, had invited them for the evening."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Curious and wary, they accepted."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The tavern was warm, filled with the scent of ale and roasting meat. The Goltiaevas greeted them with open arms, eager to hear about their homeland and language. But as the evening wore on, Katrina, the tavern keeper’s wife, leaned in close to Alaric."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“We need to leave,” he said suddenly, his expression darkening."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira frowned. “What? Why?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "He didn’t answer, only standing abruptly. Aelira turned to their hosts and offered a quick, polite excuse. “It’s late. Thank you for your hospitality.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "They left, stepping into the cold night air. Aelira turned to Alaric. “What’s going on?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric’s jaw was tight. “It’s dangerous here. The ravens spotted us, this town isn’t right, and something is going on. We need to leave.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Nadya crossed her arms. “If you leave now, you’ll freeze to death. Come back to my home. We’ll figure this out in the morning.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric’s expression hardened. “We have to go.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira sighed. “We’ll rest and discuss it tomorrow.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric’s stance wavered, then suddenly, his whole demeanor changed. He nodded slowly. “Yes. Yes, we should go back.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The others exchanged puzzled glances. But when they returned to Nadya’s and the subject was broached again, Alaric blinked in confusion."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Why would we leave?” he asked."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The silence was deafening."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira narrowed her eyes. “You were just saying we needed to leave Irrisen immediately.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric’s brow furrowed. “No, I wasn’t. Why would I say that? We have a mission here.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan exhaled sharply. “Someone cast a suggestion spell on him.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric had no memory of it."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The next morning, a sharp knock at the door shattered the uneasy quiet."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Tower guards! Open up!”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira glanced at Alaric. “What do we do?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "He shrugged. “We need to get to the Pale Tower. We could just go with them.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan scoffed. “Ask nicely.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Shut your petulant mouth,” the guard snapped. “Our captain wants to see you at the tavern.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The group exchanged looks. “Alright,” Aelira said cautiously. “Let’s see what they want.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "They were led back to the White Weasel, where a group of tower guards stood with the Goltiaevas behind the bar."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The captain stepped forward, his voice dripping with mock politeness, obviously recognizing the party. “Ah, the strangers from the south. My name is Volan Sertane, and I am here to see you arrested and taken to the Pale Tower.” His eyes narrowed. “Lay down your weapons. Spellcasters, identify yourselves.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan smirked and raised his hands. “Here’s my response.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Flames erupted from his fingertips, engulfing two guards. They howled in pain. Alaric fired his pistol, dropping one of the burning men before he could recover. Nadya joined the fray, slashing at another with her blades."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The guards surged forward, crossbows loosing bolts into the melee. Joshua lifted his hands and summoned a barrage of magic snowballs, pelting three guards—one fell, his body unmoving."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "From behind the bar, Katrina murmured a blessing, strengthening the remaining guards. Aelira snarled and retaliated with a blast of frost magic, sending ice shards streaking toward her."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Her husband Emil leveled a crossbow at Aelira and fired."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The battle raged, steel clashing against steel, magic flashing through the dimly lit tavern. One by one, the guards fell."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Only Emil remained. Nadya stepped forward, voice pleading. “Emil, stop. Lay down your crossbow. We don’t want to bury both of you.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "His face twisted with grief and fury. He raised his weapon."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "And Ivan struck him down."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Blood pooled across the wooden floor."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The room was silent, save for the heavy breathing of the survivors."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Nadya swallowed hard. “We need to go.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric frowned. “Why back to your house?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Nadya’s expression was unreadable. “I know someone who can help.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric turned to Aelira and murmured in common, “I don’t like this.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Nadya stiffened. For the first time, she responded in common. “I’m trying to get my daughter back. You don’t like that?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric turned on her. “I don’t trust any of this.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Nadya’s patience snapped. “Then go! Freeze to death in the storm if you want. But I’m going to my home, and I’m going to find help.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "She turned sharply and stormed off."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric clenched his jaw, his fingers tracing the cursed mark on his forehead. Aelira stood between them, caught between trust and doubt."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The storm howled outside."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "And the Pale Tower loomed in the distance, waiting."
          }
        ]
      }
    ]
  },
  "book": "the-snows-of-summer",
  "sessionDate": "2025-03-08"
}