{
  "id": "2025-09-28T23-03-43-457Z",
  "title": "The Frozen Trail",
  "image": "/images/winter/1759100607772-blob",
  "createdAt": "2025-09-28T23:03:43.457Z",
  "updatedAt": "2025-09-28T23:03:43.457Z",
  "excerpt": "The morning was harsh, the cold cutting through their layers as the group stirred from their meager rest. Sleep had not come easy, and their recovery from the previous day’s battles was minimal. Spells were scarce, and t",
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The morning was harsh, the cold cutting through their layers as the group stirred from their meager rest. Sleep had not come easy, and their recovery from the previous day’s battles was minimal. Spells were scarce, and the frostbitten wind gnawed at their resolve. Still, they pressed forward, making their way back to the creek crossing they had encountered before. Overnight, the waters had frozen solid once again, allowing them to carefully step across the ice without trouble."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As they ventured deeper into the wilderness, Joshua's keen eyes caught something unusual—a hand protruding from the snow, frozen stiff. He rushed forward, brushing away the frost to reveal a face he recognized."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "\"Old Man Dansby,\" he murmured grimly. The farmer from Heldren lay dead, half-buried in the drifts."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira and Joshua worked quickly to unearth the body, their grim task revealing wounds that bore an eerie familiarity. The jagged tears in his flesh were much like the injuries they had suffered at the hands of the ice elementals the day before."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "\"We can't do anything for him now,\" Aelira said softly, pressing her lips together."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua nodded, standing. \"Then we move on.\""
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Their march was quiet, the crunch of boots on snow the only sound. Then, the wind carried something new—the faint scent of smoke. The realization was quick."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“There’s a lodge up ahead,” Ivan said. “Could be occupied.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "They barely had time to consider their approach before movement burst from the underbrush. Arrows whistled through the air—an ambush."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric grunted as two shafts struck him, staggering under the impact. His pistol was in his hand in an instant, the hammer cocking back with a snap before he fired, striking one of the attackers. Joshua, undeterred, charged headlong into a bandit, forcing him to draw a sword. Meanwhile, another pair kept firing at Alaric, one of their arrows finding its mark once more."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira rushed to his side, her hands glowing with healing magic as she restored some of his wounds."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan took careful aim, loosing a crossbow bolt that felled the bandit Alaric had wounded. The gunslinger wasted no time, turning to close the distance with the remaining archer while Joshua rained fists on his opponent, pummeling him into the snow."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Seeing his allies fall, the last bandit turned to flee—but a crossbow bolt from Ivan struck him down before he could escape."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric crouched beside the bodies, examining the tracks. His sharp eye caught the familiar patterns in the snow."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“These men,” he muttered, “they were at the caravan ambush.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The connection was undeniable. If the bandits had come from the lodge ahead, they needed to press on."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The ridge gave way to a clearing, where the hunting lodge stood against the backdrop of the frozen wilderness."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua took a step—and the sharp click beneath his boot sent a chill through him that had nothing to do with the cold."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Don’t move,” Alaric said quickly, kneeling beside the trap. His fingers worked the mechanism, trying to disarm it."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "But the ice was treacherous. His hand slipped."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The trap triggered."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A flurry of crossbow bolts shot forth, piercing both Joshua and Alaric. Joshua turned, wincing at the pain, and shot Alaric a withering glare."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "\"Thanks for the help,\" he said dryly."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira wasted no time, stepping in to heal their wounds."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "They turned their attention to the lodge. Lights flickered inside. There were people within—but whether they were more bandits or something worse, they could not say."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "\"Everyone wait here,\" Alaric ordered, moving forward cautiously."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The lodge came alive in an instant. Windows were flung open, and bows were raised."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric fired first, but his shot went wide, striking the wooden frame of the window. Joshua surged forward, trying to shoulder the door open, but the man behind it held firm."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Arrows hissed from the windows. One struck Alaric, drawing another grunt of pain. Joshua took another as well, still struggling to force the door open."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira fired a ray of frost through a window, hitting a bandit, who recoiled from the freezing blast. The battle turned into a siege, each side exchanging projectiles. Arrows, bullets, and crossbow bolts flew."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric and Ivan worked together, dropping foes as they appeared at the windows, while Aelira unleashed magic into the fray. Joshua grappled with the man in the doorway, fists and steel clashing."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "At last, the lodge fell silent. They stepped inside, wary. Among the fallen, Alaric noticed something peculiar—half the men had been fully armored, but five bore dark blue splotches across their skin."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then the bodies shuddered."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A sickening sound filled the air as their flesh sloughed away, revealing bones wreathed in ice. The skeletal corpses rose, weapons still in hand, eyes glowing with unnatural cold."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric barely had time to react before three stood beside him. He turned, pressed his pistol to one’s skull, and fired. The shot shattered the bone, sending the creature crumbling."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan arrived, magic crackling in his hands as he unleashed divine energy, weakening the undead."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Another skeleton advanced, its blade cutting into Alaric, ice seeping into the wound. He stumbled back, grimacing as the chill spread through his veins."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then came the whisper of a spell. The unseen caster’s voice slithered through the room, and suddenly, the fallen skeletons began to reassemble."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua cursed. “This again?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira tried to cut off their advance, conjuring a wall of ice. But the skeletons shattered it effortlessly."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric turned his pistol on the unseen foe, but as he pulled the trigger, the gun jammed. Cursing, he dropped it and yanked free his handaxe, just as an invisible figure materialized behind Aelira—blade flashing."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira cried out, stumbling back, healing herself even as the shadowy figure split into two identical forms."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric slashed at the foe, striking true—but the illusion held, his axe cutting through empty air."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan launched a volley of magic missiles, hitting the figure twice. Joshua forced his way forward, hammering him with his fists."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then, the man staggered back, panting. Blood dripped from his wounds. His illusion flickered."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Enough,” he gasped. “I surrender.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric wiped blood from his chin, picking up his pistol to clear the jam. “Who are you?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The man hesitated, then spat, “Rohkar Cindren.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "He claimed to be from Qadira, but Alaric wasn’t convinced. When pressed, he admitted to helping murder the Sentinels guarding the border."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira’s eyes narrowed. “Alaric, these men were at the caravan ambush.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Rohkar begged. “Spare my life, and I’ll tell you where she is.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric sighed, glancing at the others. Then he nodded. “Fine.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Rohkar led them behind the fireplace, pulling away a bearskin rug to reveal a trapdoor."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Inside, a woman stood, disheveled but unmistakably noble."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“You must be Lady Argentea,” Aelira said."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The woman looked up, weary but relieved. “Yes. Yes, I am.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Their mission was complete."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As they searched the lodge, they found maps detailing ambush points, trails, and—most disturbingly—a caged winter-touched fey."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira freed the creature, which immediately darted into the night without a word of thanks."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "In a locked chest, they found an ice diamond—a hint that Rohkar might have lied about his origins."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The next day, they returned to Heldren, bringing Lady Argentea to safety. Rohkar was thrown in jail for murder."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "But the cold continued."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The village council stood before them, grim-faced."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "\"Something strange is going on,” one said. “We need someone to find out why.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The four companions exchanged looks. They were the only ones who could."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“We’ll need supplies,” Ivan stated."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“You’ll have them,” the council assured them."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "And so, the path into the heart of winter lay before them"
          }
        ]
      }
    ]
  },
  "book": "the-snows-of-summer",
  "sessionDate": "2025-02-16"
}