{
  "id": "2025-09-28T22-56-56-346Z",
  "title": "The Unnatural Cold",
  "image": "/images/winter/1759100203585-blob",
  "createdAt": "2025-09-28T22:56:56.346Z",
  "updatedAt": "2025-09-28T22:56:56.346Z",
  "excerpt": "Heldren was never a place of extreme weather. Its summers were mild, its winters predictable. Yet now, in the heart of summer, icy winds whispered through the trees, and hunters returned with wild tales of snowdrifts in",
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Heldren was never a place of extreme weather. Its summers were mild, its winters predictable. Yet now, in the heart of summer, icy winds whispered through the trees, and hunters returned with wild tales of snowdrifts in the woods. The village hummed with unease, the strange cold a harbinger of something unnatural."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As the town buzzed with rumors, another story took hold—Lady Argentea Malassene had gone missing. A rider had limped into the village, battered and frostbitten, speaking of an ambush and fey attackers. The noblewoman had vanished into the frozen wilds, and Heldren reeled from the implications."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Among the villagers, four stood apart—seasoned by past adventures and bound by their strange companionship. Joshua, a druid-monk in tune with the rhythms of nature; Ivan, an inquisitor of Nethys, wielding magic and divine law; Alaric, another inquisitor, but of Tolc, ever armed with his pistol and righteousness; and Aelira, a witch of winter, spared execution only by Alaric’s reluctant hand and her own usefulness."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira sought out Alaric first, her breath misting unnaturally in the summer air. “Something is wrong,” she murmured, fingers tracing frost on the iron railing beside her. “This isn’t just a cold snap—something bad is happening.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Before Alaric could answer, Ionnia Teppen of the village council approached, urgency in her step. “Alaric, Aelira, I'm sure you've heard that Lady Malassene is missing,” she said, worry in her voice, “You have friends in the village—can you find her? We need your help.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric barely hesitated before nodding. Duty called. The two set off to find Joshua and Ivan, relaying the news. They quickly agreed—first, they would find the rider who brought the tale."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Yuln Oerstag, the wounded soldier, recounted the attack with haunted eyes. “Bandits at first,” he rasped. “But then… fey. Fey, this far south.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira’s breath caught. The fey never strayed this far. Something unnatural had drawn them."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "\"If you plan on going after her, take my sword.\" Yuln said, unstrapping the scabbard and offering it, \"It's cold iron, it will hurt the fey.\""
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "With Yuln’s directions, they gathered supplies and set out, moving south. By the day’s end, they found the wreckage. Two caravan wagons, one overturned, bodies stiff with unnatural frost. As they searched for signs of Lady Malassene, Joshua’s sharp ears caught a muffled thump inside the upright wagon. A spear wedged the door closed."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua gestured to Alaric. “Something’s inside.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric nodded, drawing his pistol as Joshua yanked the spear free. The door burst open, and the stench of death rushed out as two rotting figures lunged at them."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua barely had time to react before cold, dead hands grabbed at him. Alaric stepped back, leveling his pistol. The crack of gunfire echoed through the clearing, the shot tearing through a zombie’s chest. Hearing the shot, Ivan and Aelira sprinted toward the wagon. Aelira’s hands glowed with healing energy, her magic mending Joshua’s wounds as Ivan loosed crossbow bolts."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Another gunshot—a corpse fell. Joshua drove his fist into the other zombie’s skull, and it collapsed."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Among the ruins, they found a man frozen solid—his limbs scattered around him as if he had been shattered. But no sign of Lady Malassene. Instead, drag marks led away from the site. The group pressed on, the unnatural cold thickening the air."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The first attack came suddenly. Tiny arrows whistled from the trees, biting into exposed flesh. Looking up, they saw the culprits—sprites, their tiny bows drawn."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua moved under one’s perch, but it flitted away, laughing. Alaric raised his pistol, took aim, and fired—the sprite crumpled, its wings fluttering uselessly. Ivan followed with a crossbow bolt, ending another. But a third sprite hovered behind them, weaving a spell."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A burst of color erupted, and Aelira crumpled to the ground, unconscious."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric whirled, firing. The sprite shrieked, wounded, and Ivan finished it—hurling his holy book with surprising accuracy, crushing the creature. The last sprite, seeing its fate, darted into the trees, its eerie glow vanishing into the night."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "They moved on, wary now. The cold deepened, and then they saw it—a white elk, massive and unmoving in their path."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then, a voice. “Why are you in my forest?”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira stepped forward. “We seek a lost woman. She came this way.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Go back,” the voice warned. “This is not your path.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua clenched his fists. “We’re not going back.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The elk charged."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric raised his pistol—but it shrank in his hand, a cruel spell warping its size. He cursed, scanning the area for the hidden caster. The elk slammed into Joshua, its antlers driving deep. Ivan fired bolts, Aelira searched for the spellcaster, but none could see the source."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric gritted his teeth, drew the sword given to him by Yuln, and advanced. But before he could strike, Joshua drove his fists into the beast, bringing it down."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A furious shriek rang out. A small fey materialized, its face twisted in rage as it lunged at Joshua."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan fired, his bolt sinking into the fey’s shoulder. Alaric followed with a sword strike, ending the fight."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Wearied but determined, they continued. The river crossing, Wishbone Creek, came into view. There, standing motionless, was a snowman with a crude sign: Trespassers Turn Back."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira stepped forward, but Alaric held up a hand. “Let me.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“We seek someone in danger,” Aelira called."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The snowman remained still. Alaric took a cautious step."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The snowman exploded."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A deafening blast shook the air, stunning Ivan and Joshua. From the river, ice elementals emerged, hurling frozen missiles. One struck Alaric hard, sending pain lancing through his body."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua charged, but the ice cracked beneath him, plunging him into freezing water. The elementals moved in, hammering him with blows as hypothermia crept into his limbs."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric fired, striking one of the creatures. Ivan unleashed magic missiles, tearing through icy forms. Joshua, battered and drowning, began to fade."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira darted forward, her hands glowing, and pressed against Joshua’s chest. His eyes snapped open, but the elementals turned on her next. They struck hard, and she fell."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "With a roar, Alaric fired—one elemental shattered. Fire flew from Ivan's hand as he cast, and the second exploded into shards."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Breathing hard, shivering from the cold, Alaric wiped ice from his face. “There’s a cave nearby,” he said. “We need rest.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua lifted Aelira’s unconscious form, and they trudged toward shelter. In the cave, they pitched a tent, lit a fire, and huddled together for warmth."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The cold seeped in, relentless. Even in sleep, the winter pressed close, whispering a question none of them could yet answer:"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Where did the winter come from?"
          }
        ]
      }
    ]
  }
}