{
  "id": "2025-09-28T23-10-48-436Z",
  "title": "The Witch's Doll",
  "image": "/images/winter/1759101033620-blob",
  "createdAt": "2025-09-28T23:10:48.436Z",
  "updatedAt": "2025-09-28T23:10:48.436Z",
  "excerpt": "The icy wind cut across the landscape as the group departed Heldren, determined to uncover the unnatural winter’s source. Their journey led them once more to the hunting lodge, but this time, the path took them across a",
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The icy wind cut across the landscape as the group departed Heldren, determined to uncover the unnatural winter’s source. Their journey led them once more to the hunting lodge, but this time, the path took them across a treacherous rope bridge, swaying dangerously in the wind."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ice and snow coated the bridge, making each step uncertain. To ensure their safety, they anchored a rope to a sturdy tree on the far side, tying the other end to Joshua before securing themselves in a line. Joshua led the way, moving with care. Midway, his foot slipped, his body tilting dangerously toward the abyss. With a sharp intake of breath, he caught himself and pushed forward, reaching the other side."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric followed next. His step faltered, and he dropped to his knees with a jarring thud, his breath misting before him. Gritting his teeth, he pulled himself upright and continued. Aelira moved next, light-footed and unbothered by the treacherous ice, reaching safety with ease. Last was Ivan. He untied the rope from the original side, securing it around his waist before stepping onto the bridge."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Once across, they pressed on. Snow crunched beneath their boots as they followed the forest path. Suddenly, Alaric raised a hand, signaling a halt. He crouched and inspected tracks half-buried in the snow—misshapen footprints, staggering and clumsy."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Something's not right,” he murmured."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira knelt beside him, brushing snow away to better see the prints. Recognition flickered in her eyes. “Skeletons,” she said grimly. “Undead.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric let out an exasperated sigh. “Of course they are.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The tracks led in the same direction as they were traveling, and soon enough, they found their quarry. A clearing ahead was filled with the shuffling remains of the dead. The skeletons turned as one upon seeing the living, empty sockets glowing with eerie malevolence. Without hesitation, they attacked."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua, at the front, took the brunt of the assault. Bony fists struck him, rattling his frame, but he held his ground. Alaric leveled his pistol and fired, the report echoing through the clearing. Ivan followed with a burst of divine energy, reducing a skeleton to splintered bone. Aelira kept Joshua standing, weaving healing magic into his wounds as the group fought, wearing down the relentless undead until, at last, Joshua crushed the skull of the final skeleton beneath his fist."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Their victory was short-lived. Alaric once more spotted tracks in the snow. This time, Joshua recognized them as belonging to a giant weasel. He recalled a hunter in Heldren, speaking of a great white beast that he sought to bring down."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "It wasn’t long before they found the hunter’s fate—his frozen body, mauled and lifeless. A journal rested beside him, its pages stiff with ice. They read of his hunt, his pursuit of the white weasel, and his mention of a strange hut with an eerie doll inside."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Determined, they tracked the beast, following its path until Alaric noted something unsettling."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“The tracks lead to Somir Valley,” he said. “The hunter mentioned setting bear traps here.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Just be careful not to step in one,” Aelira warned."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "At a clearing, as they debated resting, the trees around them came alive. Without warning, they rushed forward, animated with unnatural rage. One slammed into Ivan, the impact driving the air from his lungs. Sticky sap coated his armor, hindering his movements."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric fired, his shot chipping away at bark that should not bleed. Joshua’s fists connected with solid wood, while Aelira swung her lantern staff, firelight reflecting off its polished surface. The battle was brutal—bludgeoning force against sheer endurance—but at last, they felled the living trees, Joshua landing the final strike."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The mystery of winter’s grip upon the land drove them onward. As they traveled, a distant sound reached their ears—a deep, pained growl."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira’s pet ermine, Eira, shifted uneasily. Aelira gently stroked its nose. “She thinks we’re being followed.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The group advanced cautiously and found two polar bears caught in steel traps. One, the mother, lay still, her breath long since ceased. The cub, panicked, gnawed desperately at the trap."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua moved forward, anger and sorrow warring in his expression. He barely had time to react before the white weasel burst from beneath the snow in an ambush, sinking its teeth into his flesh."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric fired. Ivan’s crossbow bolt followed, while Aelira unleashed magic. The weasel was fast, but the group fought with precision. The beast fell, lifeless, upon the crimson-stained snow."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua turned to the cub, extending his hands in a calming gesture. He spoke softly, his bond with nature soothing the frightened creature. Slowly, he approached, murmuring gentle words. When the bear finally rolled over in trust, Joshua freed it from the trap and tended to its wound."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The cub, now orphaned, clung to Joshua. He named it Titan."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "With the young bear following, they pressed forward, eventually reaching a field strewn with frozen boulders. Among them, Alaric saw a child—a small girl, shivering."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“Hello, child?” he called."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "She flinched. “I didn’t mean to insult you. Please don’t hurt me.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira approached gently. “We won’t hurt you. We’re here to help.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“I miss my mother.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira stiffened at the name the girl whispered—Ms. Vasilliovna. “That’s a white witch’s name.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Suddenly, the girl darted behind a boulder, vanishing. Moments later, Alaric spotted her again, far across the field. The child’s voice drifted through the wind."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "“They took me from my mother. The Pale Tower.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As the group neared a hut perched atop what looked like clawed legs, Aelira whispered, “Witchcraft.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Inside, a doll rested, eerily similar to the child. Its mismatched eyes—one a gemstone, the other a mirror—glistened in the dim light."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira reached out, touching the gemstone."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The doll sprang to life. A dagger flashed, grazing Aelira’s skin. Paralysis overtook her, and she slumped into a chair."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua rushed in, followed by Ivan. The doll hovered above Aelira, its presence suffocating, the air turning frigid. Ivan struck with his book, alerting Alaric, who fired—but the tiny, malevolent thing was hard to hit."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The doll plunged its dagger into Aelira once more. Blood welled, her breath shuddering. With effort, she moved, grasping the doll tightly."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Joshua struck. The doll stabbed again. Aelira fell limp once more."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Then Alaric focused. He invoked his holy judgment, his shot ringing true. The bullet shattered the doll, shards scattering across the floor."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Ivan pulled Aelira from the hut, healing her with his magic. They gathered the gem that had once been the doll’s eye before quickly departing."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As they traveled, a sign loomed before them:"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "TURN BACK BEFORE WINTER CONSUMES YOU."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Aelira scoffed. “We’re going the right way.”"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The sign exploded in a blast of cold, engulfing them. Aelira gritted her teeth and healed the group."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Night fell. They made camp, finding shelter among the trees. Just as sleep threatened to claim them, a gust of air roared through, extinguishing the fire. The darkness came alive—an air elemental and an ice mephit struck in unison."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Titan snarled, engaging the mephit, while Alaric’s gun flared to life, casting eerie light across the battlefield. The elemental struck, but Aelira conjured a kinetic shield. As the elemental flew at Alaric, it smashed headlong into the barrier, shattering on impact."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Alaric chuckled. Aelira shrugged."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The mephit fought desperately, but Ivan’s fire ended its struggle."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Exhausted, they rekindled the fire. But as the wind howled through the trees, they knew rest would not last. What was the Pale Tower, and what held the dark secrets of winter’s curse?"
          }
        ]
      }
    ]
  },
  "book": "the-snows-of-summer",
  "sessionDate": "2025-02-22"
}